#Если Клиент Тогда

Функция Открыть(Владелец) Экспорт
	ПараметрыФормы = А1Э_Структуры.Создать(
	"Владелец", Владелец,
	);
	ОткрытьФорму("ОбщаяФорма.А1Файлы", ПараметрыФормы, , Владелец);
КонецФункции 

#КонецЕсли
 
#Область Механизм

Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаПриСозданииНаСервере", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		Если НЕ Форма.Параметры.Свойство("Владелец") Тогда
			А1Э_Служебный.СлужебноеИсключение("Невозможно открыть форму просмотра файло без указания параметра Владелец!");
		КонецЕсли;
		МассивОписаний = Новый Массив;
		А1Файлы_КомпонентТаблицаПрисоединенных.ДобавитьОписание(МассивОписаний, , Форма.Параметры.Владелец);
		А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
	КонецФункции 
	
#КонецЕсли

#КонецОбласти 

