Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаЭлементаПриСозданииНаСервере", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт 
		МассивОписаний = Новый Массив;
		А1Э_Формы.ДобавитьОписаниеПоляОбъекта(МассивОписаний, "Код");
		А1Э_Формы.ДобавитьОписаниеПоляОбъекта(МассивОписаний, "Наименование");
		А1Файлы.А1БК_ПолеВыбораФайла().ДобавитьОписаниеПоляОбъекта(МассивОписаний, "Путь", А1Э_Структуры.Создать(
		"Режим", "ВыборКаталога",
		));
		А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
	КонецФункции
	
#КонецЕсли
 